create table sample_scores.members (
  id int not null,
  member_name varchar(255) not null,
  team_id int not null,
  primary key (id)
);

insert into sample_scores.members (id, member_name, team_id) values
  -- Team A
  (2001, '太郎', 1001), (2002, '次郎', 1001), (2003, '花子', 1001), (2004, '一郎', 1001), (2005, '二郎', 1001),
  -- Team B
  (2006, '三郎', 1002), (2007, '四郎', 1002), (2008, '美智子', 1002), (2009, '五郎', 1002), (2010, '六郎', 1002),
  -- Team C
  (2011, '恵子', 1003), (2012, '夏子', 1003), (2013, '春子', 1003), (2014, '秋子', 1003), (2015, '冬子', 1003),
  -- Team D
  (2016, '武', 1004), (2017, '真由美', 1004), (2018, '弘明', 1004), (2019, '英二', 1004), (2020, '知子', 1004),
  -- Team E
  (2021, '悠斗', 1005), (2022, '大樹', 1005), (2023, '怜央', 1005), (2024, '愛美', 1005), (2025, '美桜', 1005);